#include <stdio.h>

//int main()
//{
//	int n = 10;
//	int num = n << 1;
//	printf("%d %d", n, num);
//	return 0;
//}

//int main()
//{
//	int num = -1;
//	//1000 0000 0000 0000 0000 0000 0000 0001
//	//1111 1111 1111 1111 1111 1111 1111 1110
//	//1111 1111 1111 1111 1111 1111 1111 1111
//	//算术右移：高位补负号
//	//11111 1111 1111 1111 1111 1111 1111 111(1-丢弃)
//	//逻辑右移：补0
//	//01111 1111 1111 1111 1111 1111 1111 111(1-丢弃)
//	printf("%d", num >> 1);
//	return 0;
//}

//int main()
//{
//	int a = 5;//0101
//	int b = a & 1;
//	int c = a | 1;
//	int d = a ^ 1;
//	int e = ~a;
//	printf("%d %d %d %d", b, c, d, e);
//	return 0;
//}

#include <stdio.h>
//int main()
//{
//	int a = 5, b = 3;
//	a = a ^ b;
//	b = a ^ b;//a^b=a^b^b=a^0=a
//	a = a ^ b;//a^b=a^b^a = b
//	printf("%d %d", a, b);
//	return 0;
//}
//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, a, b = a + 1);
//	printf("%d", c);
//}

//int main()
//{
//	char a = 5;
//	//00000000000000000000000000000101
//	//赋值给char，需要截断：00000101
//	char b = 126;
//	//00000000000000000000000001111110
//	//赋值给char，需要阶段：01111110
//	char c = a + b;
//	//00000000000000000000000000000101
//	//00000000000000000000000001111110
//	//00000000000000000000000010000011
//	//10000011-c
//	printf("%d", c);//打印的为原码，所以c会再一次进行整形提升
//	//11111111111111111111111110000011 - 此时在内存的为补码，需要转换
//	//10000000000000000000000001111100
//	//10000000000000000000000001111101 - -125
//}
int main()
{
	char c = 1;
	printf("%u\n", sizeof(c));
	printf("%u\n", sizeof(+c));
	return 0;
}